// 16개의 성향을 포함한 하나의 배열!
export const resultcontent = [
  {
    type: "ISTJ",
    description: {
      img: "./image/hwang.jpg",
      name: "황준호",
      signature: "우리 형은 어딨지? 차근차근 잠입해보자!",
      about: "청렴결백한 논리주의자",
      explain:
        "사실에 근거하여 사고하며 이들의 행동이나 결정 사항에 한 치의 의심을 사지 않는 현실주의자형, 형을 찾기 위해서 서두르지 않으며 흔들리지 않고 진실을 밝혀낸다!",
    },
  },
  {
    type: "ISFJ",
    description: {
      img: "./image/dawn.jpg",
      name: "강새벽",
      signature: "좋아..끝까지 남을 해치지 않고 이 게임에서 살아남겠어!",
      about: "용감한 수호자",
      explain:
        "소중한 이들을 수호하는데 심혈을 기울이는 헌신적이며 성실한 방어자형, 최대한 남에게 피해를 주지 않고 끝까지 살아남으려는 방어생존형!",
    },
  },
  {
    type: "INFJ",
    description: {
      img: "./image/aleeambdul.jpg",
      name: "알리",
      signature: "우리 같이 열심히 해봐요! 사장님~ 고마워요~",
      about: "선의의 옹호자",
      explain:
        "바라는 이상향을 꿈꾸는데 절대 게으름 피우는 법이 없으며,목적을 달성하고 지속적으로 긍정적인 영향을 미치고자 구체적으로 계획을 세워 이행 , 사람을 의심하지 않고 긍정적으로 살아가려는 긍정생존형!",
    },
  },
  {
    type: "INTJ",
    description: {
      img: "./image/josangwu.jpg",
      name: "조상우",
      signature: "내 전략으로 가보자. 우리 협동해서 구슬치기를 해볼래?",
      about: "용의주도한 전략가",
      explain:
        "전략적 사고에 뛰어나며 정확하고 계산된 움직임과 풍부한 지식을 소유하고 있는 이들 , 논리적으로 상황을 파악하며 살아남기위하여 뛰어난 전략을 세우는 전략생존형!",
    },
  },
  {
    type: "ISTP",
    description: {
      img: "./image/circle.jpg",
      name: "동그라미진행요원",
      signature: "나는 평범한 일꾼이지만 다재다능~",
      about: "만능 재주꾼",
      explain:
        "대담하고 현실적인 성향으로 다양한 도구 사용에 능숙한 탐험형, 수많은 일꾼 하지만 오징어게임에 그들의 능력이 없었다면 오징어 게임은 존재하지 못했을 것 다재다능 동그라미!",
    },
  },
  {
    type: "ISFP",
    description: {
      img: "./image/mathTeacher.jpg",
      name: "수학선생",
      signature: "오케이 이 확률로 저 다리로 다 건너가보겠어! 으악~!",
      about: "호기심 많은 예술가",
      explain:
        "항시 새로운 것을 찾아 시도하거나 도전할 준비가 되어 있는 융통성 있는 성격의 매력 넘치는 예술가형, 유리 다리를 건널 때에 순간적인 두뇌에 자기가 살아남을 수 있을까라하는 호기심, 끝없이 도전하겠어.. 탐구생존형!",
    },
  },
  {
    type: "INFP",
    description: {
      img: "./image/gohun.jpg",
      name: "성기훈",
      signature: "그럼 우리 다같이 힘모아서 잘해보면 되겠네?!",
      about: "열정적인 중재자",
      explain:
        "중재자형 사람은 최악의 상황이나 악한 사람에게서도 좋은 면만을 바라보며 긍정적이고 더 나은 상황을 만들고자 노력하는 진정한 이상주의자 , 모두 다 좋은 쪽으로 해결되면 좋겠어. 다들 사이좋게 이 상황을 헤쳐나갔으면 좋겠는 중재생존형!",
    },
  },
  {
    type: "INTP",
    description: {
      img: "./image/square.jpg",
      name: "네모진행요원",
      signature: "내가 진행요원 중엔 탑이다! 너네들 내가 다 보고 있다~",
      about: "논리적인 사색가",
      explain:
        "이들은 사건이나 사물의 어떠한 일련의 연속성에 관심이 많으며,사람들의 언행에 불일치되는 부분을 집어내 트집 잡는 것을 즐기는데, 이는 거의 취미 수준에 가까울 정도, 참가자의 모든 행위들을 관찰해 잘못된 것을 잡아내는 매의 눈 네모!",
    },
  },
  {
    type: "ESTP",
    description: {
      img: "./image/glassexpert.jpg",
      name: "도정수 유리전문가",
      signature: "이 유리는 빛을 안 받는 거보니 강화유립니다! 으악!!",
      about: "모험을 즐기는 사업가",
      explain:
        "벼랑 끝의 아슬아슬한 삶을 진정으로 즐길 줄 아는 이들로 명석한 두뇌와 에너지, 그리고 뛰어난 직관력을 가지고 있는 유형, 위험한 상황에서도 뛰어난 분석력으로 해결법을 찾아내는 분석생존형!",
    },
  },
  {
    type: "ESFP",
    description: {
      img: "./image/hanlady.jpg",
      name: "한미녀",
      signature:
        "워후~ 내가 바로 한미녀~ 어디가든 날 받아주지 나는야 분위기 메이커~",
      about: "자유로운 영혼의 연예인",
      explain:
        "주위에 있으면 인생이 지루할 새가 없을 정도로 즉흥적이며 열정과 에너지가 넘치는 연예인형, 일단 내가 있으면 여기는 분위기 살았다! 기 죽을 일 없는 에너지생존형!",
    },
  },
  {
    type: "ENFP",
    description: {
      img: "./image/jiyoung.jpg",
      name: "지영",
      signature: "새벽아 난 너와 함께 게임해서 좋았어 고마워",
      about: "재기발랄한 활동가",
      explain:
        "창의적이며 항상 웃을 거리를 찾아다니는 활발한 성격으로 사람들과 자유롭게 어울리기를 좋아하는 넘치는 열정의 소유자, 사실 그녀는 자신과 맞는 사람이 있다면 친근한 사람 그녀는 친근생존형!",
    },
  },
  {
    type: "ENTP",
    description: {
      img: "./image/crazyDoctor.jpg",
      name: "돌파리 의사",
      signature: "이 사람 작업해줄테니까 다음 게임 알려달란 말이야..!",
      about: "뜨거운 논쟁을 즐기는 변론가",
      explain:
        "타인이 믿는 이념이나 논쟁에 반향을 일으킴으로써 군중을 선동하는 일명 선의의 비판자,현존하는 제도를 재고하게 하거나 체제 자체를 흔들어 새로운 방안을 모색 , 기존의 틀에서는 살아남을 수 없을 것 같아 나름의 부정행위를 찾는 비판생존형!",
    },
  },
  {
    type: "ESTJ",
    description: {
      img: "./image/frontman.jpg",
      name: "프론트맨",
      signature:
        "내 눈에서 벗어날 수는 없습니다. 나는야 실질적인 게임의 관리자",
      about: "엄격한 관리자",
      explain:
        "사물이나 사람을 관리하는데 타의 추종을 불허하는 뛰어난 실력을 갖춘 관리자형, 사실은 실질적인 관리자이며 그의 스토리는 아무도 알 수 없다. 하지만 많은 일꾼과 참가자를 컨트롤하는 오징어게임의 왕!",
    },
  },
  {
    type: "ESFJ",
    description: {
      img: "./image/gongu.jpg",
      name: "딱지맨 공유",
      signature:
        "저랑 딱지치기 하실래요? 이기면 10만원을 드리겠습니다^^ 대신 지면 뺨따구~",
      about: "사교적인 외교관",
      explain:
        "타인을 향한 세심한 관심과 사교적인 성향으로 사람들 내에서 인기가 많으며, 타인을 돕는데 열성적인 세심형, 도움을 필요한 그대에게 게임을 제안하며 뺨도 때리고 돈도 주는 천사형 헬퍼!",
    },
  },
  {
    type: "ENFJ",
    description: {
      img: "./image/jangduksu.jpg",
      name: "덕수",
      signature: "나만 따라와~ 그럼 여기서 살아남게 해줄게",
      about: "정의로운 사회운동가",
      explain:
        "카리스마와 충만한 열정을 지닌 타고난 리더형, 카리스마는 탑 자신의 눈에 잘못걸리면 죽이 되는 카리스마생존형!",
    },
  },
  {
    type: "ENTJ",
    description: {
      img: "./image/oillnam.jpg",
      name: "오일남",
      signature: "이러다가 다~죽어! 제발~ 그만해잇!",
      about: "대담한 통솔자",
      explain:
        "통솔자형 사람은 천성적으로 타고난 리더입니다.이 유형에 속하는 사람은 넘치는 카리스마와 자신감으로 공통의 목표 실현을 위해 다른 이들을 이끌고 진두지휘, 이렇게 하다가는 다 죽는다며 상황을 끝내버리는 진정한 리더쉽을 가진 흑막생존형!",
    },
  },
];
